tinnfu/CEM5826-M11-MM32L0136C7P/Device/MM32L0130/Include/reg_rcc.h
/**
  * @brief RCC_BDCR Register Bit Definition
  */
#define  RCC_BDCR_LSEON_Pos                       (0)
#define  RCC_BDCR_LSEON_Msk                       (0x01U << RCC_BDCR_LSEON_Pos)                     /*!<External Low-speed Oscillator Enable*/
#define  RCC_BDCR_LSERDY_Pos                      (1)
#define  RCC_BDCR_LSERDY_Msk                      (0x01U << RCC_BDCR_LSERDY_Pos)                    /*!<External Low-speed Oscillator Ready*/
#define  RCC_BDCR_LSEBYP_Pos                      (2)
#define  RCC_BDCR_LSEBYP_Msk                      (0x01U << RCC_BDCR_LSEBYP_Pos)                    /*!<External Low-speed Oscillator Bypass*/
#define  RCC_BDCR_LCDSEL_Pos                      (6)
#define  RCC_BDCR_LCDSEL_Msk                      (0x03U << RCC_BDCR_LCDSEL_Pos)                    /*!<LCD clock source selection is set as the clock source by software to select LCD. Once LCD clock source is selected, it cannot be changed unless the backup domain is reset. LCDRST bit can be used to reset them.*/
#define  RCC_BDCR_RTCSEL_Pos                      (8)
#define  RCC_BDCR_RTCSEL_Msk                      (0x03U << RCC_BDCR_RTCSEL_Pos)                    /*!<RTC Clock Source Selection*/
#define  RCC_BDCR_RTCEN_Pos                       (15)
#define  RCC_BDCR_RTCEN_Msk                       (0x01U << RCC_BDCR_RTCEN_Pos)                     /*!<RTC Clock Enable*/
#define  RCC_BDCR_RTCRST_Pos                      (16)
#define  RCC_BDCR_RTCRST_Msk                      (0x01U << RCC_BDCR_RTCRST_Pos)                    /*!<RTC/BKP software reset*/
#define  RCC_BDCR_LCDRST_Pos                      (17)
#define  RCC_BDCR_LCDRST_Msk                      (0x01U << RCC_BDCR_LCDRST_Pos)                    /*!<LCD software reset*/
#define  RCC_BDCR_DBP_Pos                         (24)
#define  RCC_BDCR_DBP_Msk                         (0x01U << RCC_BDCR_DBP_Pos)                       /*!<Remove write protection from the backup domain. After reset, the backup register is protected against accidental writing. This bit is set to allow being written to these registers.*/

/**
  * @brief RCC_CSR Register Bit Definition
  */
#define  RCC_CSR_LSION_Pos                        (0)
#define  RCC_CSR_LSION_Msk                        (0x01U << RCC_CSR_LSION_Pos)                      /*!<Internal Low-speed Oscillator Enable*/
#define  RCC_CSR_LSIRDY_Pos                       (1)
#define  RCC_CSR_LSIRDY_Msk                       (0x01U << RCC_CSR_LSIRDY_Pos)                     /*!<Internal Low-speed Oscillator Ready*/
#define  RCC_CSR_LSISEL_Pos                       (2)
#define  RCC_CSR_LSISEL_Msk                       (0x03U << RCC_CSR_LSISEL_Pos)                     /*!<LSI Clock Frequency Select Bit*/
#define  RCC_CSR_LSCLKSEL_Pos                     (4)
#define  RCC_CSR_LSCLKSEL_Msk                     (0x01U << RCC_CSR_LSCLKSEL_Pos)                   /*!<LSCLK Clock Source Select Bit*/
#define  RCC_CSR_LSIOE_Pos                        (5)
#define  RCC_CSR_LSIOE_Msk                        (0x01U << RCC_CSR_LSIOE_Pos)                      /*!<LSI Output Enable*/
#define  RCC_CSR_PVDRSTEN_Pos                     (6)
#define  RCC_CSR_PVDRSTEN_Msk                     (0x01U << RCC_CSR_PVDRSTEN_Pos)                   /*!<PVD Reset Enable*/
#define  RCC_CSR_LOCKUPEN_Pos                     (7)
#define  RCC_CSR_LOCKUPEN_Msk                     (0x01U << RCC_CSR_LOCKUPEN_Pos)                   /*!<CPU Lockup Reset Enable*/
#define  RCC_CSR_PVDRSTF_Pos                      (22)
#define  RCC_CSR_PVDRSTF_Msk                      (0x01U << RCC_CSR_PVDRSTF_Pos)                    /*!<PVD Reset Flag*/
#define  RCC_CSR_LOCKUPF_Pos                      (23)
#define  RCC_CSR_LOCKUPF_Msk                      (0x01U << RCC_CSR_LOCKUPF_Pos)                    /*!<CPU Lockup Reset Flag*/
#define  RCC_CSR_RMVF_Pos                         (24)
#define  RCC_CSR_RMVF_Msk                         (0x01U << RCC_CSR_RMVF_Pos)                       /*!<Remove Reset Flag*/
#define  RCC_CSR_PINRSTF_Pos                      (26)
#define  RCC_CSR_PINRSTF_Msk                      (0x01U << RCC_CSR_PINRSTF_Pos)                    /*!<PIN Reset Flag*/
#define  RCC_CSR_PORRSTF_Pos                      (27)
#define  RCC_CSR_PORRSTF_Msk                      (0x01U << RCC_CSR_PORRSTF_Pos)                    /*!<POR/PDR Reset Flag*/
#define  RCC_CSR_SFTRSTF_Pos                      (28)
#define  RCC_CSR_SFTRSTF_Msk                      (0x01U << RCC_CSR_SFTRSTF_Pos)                    /*!<Software Reset Flag*/
#define  RCC_CSR_IWDGRSTF_Pos                     (29)
#define  RCC_CSR_IWDGRSTF_Msk                     (0x01U << RCC_CSR_IWDGRSTF_Pos)                   /*!<Independent Watchdog Reset Flag*/
#define  RCC_CSR_WWDGRSTF_Pos                     (30)
#define  RCC_CSR_WWDGRSTF_Msk                     (0x01U << RCC_CSR_WWDGRSTF_Pos)                   /*!<Window Watchdog Reset Flag*/
#define  RCC_CSR_LPWRRSTF_Pos                     (31)
#define  RCC_CSR_LPWRRSTF_Msk                     (0x01U << RCC_CSR_LPWRRSTF_Pos)                   /*!<Low Power Reset Flag*/

/**
  * @brief RCC_AHBRSTR Register Bit Definition
  */
#define  RCC_AHBRSTR_DMA_Pos                      (0)
#define  RCC_AHBRSTR_DMA_Msk                      (0x01U << RCC_AHBRSTR_DMA_Pos)                    /*!<DMA Reset*/
#define  RCC_AHBRSTR_CRC_Pos                      (6)
#define  RCC_AHBRSTR_CRC_Msk                      (0x01U << RCC_AHBRSTR_CRC_Pos)                    /*!<CRC Reset*/
#define  RCC_AHBRSTR_GPIOA_Pos                    (17)
#define  RCC_AHBRSTR_GPIOA_Msk                    (0x01U << RCC_AHBRSTR_GPIOA_Pos)                  /*!<GPIOA Reset*/
#define  RCC_AHBRSTR_GPIOB_Pos                    (18)
#define  RCC_AHBRSTR_GPIOB_Msk                    (0x01U << RCC_AHBRSTR_GPIOB_Pos)                  /*!<GPIOB Reset*/
#define  RCC_AHBRSTR_GPIOC_Pos                    (19)
#define  RCC_AHBRSTR_GPIOC_Msk                    (0x01U << RCC_AHBRSTR_GPIOC_Pos)                  /*!<GPIOC Reset*/
#define  RCC_AHBRSTR_GPIOD_Pos                    (20)
#define  RCC_AHBRSTR_GPIOD_Msk                    (0x01U << RCC_AHBRSTR_GPIOD_Pos)                  /*!<GPIOD Reset*/
#define  RCC_AHBRSTR_GPIOH_Pos                    (24)
#define  RCC_AHBRSTR_GPIOH_Msk                    (0x01U << RCC_AHBRSTR_GPIOH_Pos)                  /*!<GPIOH Reset*/

/**
  * @brief RCC_CFGR2 Register Bit Definition
  */
#define  RCC_CFGR2_LPUARTCLKSEL_Pos               (0)
#define  RCC_CFGR2_LPUARTCLKSEL_Msk               (0x03U << RCC_CFGR2_LPUARTCLKSEL_Pos)             /*!<LPUART clock source selection*/
#define  RCC_CFGR2_APB1_CLK_HV_PRE_Pos            (16)
#define  RCC_CFGR2_APB1_CLK_HV_PRE_Msk            (0x0FU << RCC_CFGR2_APB1_CLK_HV_PRE_Pos)          /*!<APB1_HV Output Clock Division Factor*/
#define  RCC_CFGR2_MCOPRE_Pos                     (20)
#define  RCC_CFGR2_MCOPRE_Msk                     (0x0FU << RCC_CFGR2_MCOPRE_Pos)                   /*!<MCOPRE: MCO Clock Prescaler Factor*/
#define  RCC_CFGR2_LPTIMCLKSEL_Pos                (29)
#define  RCC_CFGR2_LPTIMCLKSEL_Msk                (0x03U << RCC_CFGR2_LPTIMCLKSEL_Pos)              /*!<LPTIM clock source selection*/

/**
  * @brief RCC_SYSCFG Register Bit Definition
  */
#define  RCC_SYSCFG_PROG_CHECK_EN_Pos             (0)
#define  RCC_SYSCFG_PROG_CHECK_EN_Msk             (0x01U << RCC_SYSCFG_PROG_CHECK_EN_Pos)           /*!<Check whether the data in Flash is 0xFF when writing Flash*/
#define  RCC_SYSCFG_HSE_RFB_SEL_Pos               (8)
#define  RCC_SYSCFG_HSE_RFB_SEL_Msk               (0x03U << RCC_SYSCFG_HSE_RFB_SEL_Pos)             /*!<HSE_RFB_SEL: Feedback Resistor Selection.*/
#define  RCC_SYSCFG_HSELPFEN_Pos                  (14)
#define  RCC_SYSCFG_HSELPFEN_Msk                  (0x01U << RCC_SYSCFG_HSELPFEN_Pos)                /*!<External Crystal Low-pass Filter Enable*/

/**
  * @brief RCC_PLLCFGR Register Bit Definition
  */
#define  RCC_PLLCFGR_PLLSRC_Pos                   (0)
#define  RCC_PLLCFGR_PLLSRC_Msk                   (0x01U << RCC_PLLCFGR_PLLSRC_Pos)                 /*!<PLL Entry Clock Source Selection*/
#define  RCC_PLLCFGR_PLLXTPRE_Pos                 (1)
#define  RCC_PLLCFGR_PLLXTPRE_Msk                 (0x01U << RCC_PLLCFGR_PLLXTPRE_Pos)               /*!<Division selection when HSE clock is used as PLL input*/
#define  RCC_PLLCFGR_PLL_ICTRL_Pos                (2)
#define  RCC_PLLCFGR_PLL_ICTRL_Msk                (0x03U << RCC_PLLCFGR_PLL_ICTRL_Pos)              /*!<PLL CP Current Control Signals*/
#define  RCC_PLLCFGR_PLL_LDS_Pos                  (4)
#define  RCC_PLLCFGR_PLL_LDS_Msk                  (0x03U << RCC_PLLCFGR_PLL_LDS_Pos)                /*!<PLL Lock Detector Accuracy Select*/
#define  RCC_PLLCFGR_PLLDIV_Pos                   (8)
#define  RCC_PLLCFGR_PLLDIV_Msk                   (0x07U << RCC_PLLCFGR_PLLDIV_Pos)                 /*!<PLL Divide Factor*/
#define  RCC_PLLCFGR_PLLMUL_Pos                   (16)
#define  RCC_PLLCFGR_PLLMUL_Msk                   (0xFFU << RCC_PLLCFGR_PLLMUL_Pos)                 /*!<PLL Multiplication Factor*/
#define  RCC_PLLCFGR_PLLPDIV_Pos                  (29)
#define  RCC_PLLCFGR_PLLPDIV_Msk                  (0x07U << RCC_PLLCFGR_PLLPDIV_Pos)                /*!<PLL Pre-divider Factor*/


#endif

